In [1]:
import pandas as pd
import numpy as np
df=pd.read_csv(r'C:\Users\ASUS\Desktop\Python Working On\zomato.csv')   ## The main dataset

In [2]:
df=df.drop(columns=['address','phone','dish_liked','menu_item','reviews_list'])   ## Removing unnecessary columns

In [3]:
df=df.drop_duplicates(subset ='name')   ## Most restaurants have multiple rows, these rows are now identical after removing the previous columns

In [4]:
df['approx_cost(for two people)']=df['approx_cost(for two people)'].replace('NaN',np.nan)
df=df.dropna(subset=['approx_cost(for two people)'])
df['approx_cost(for two people)'].unique()
   ## Eliminating restaurants with invalid price column data

array(['800', '300', '600', '700', '550', '500', '450', '650', '400',
       '900', '200', '750', '150', '850', '100', '1,200', '350', '250',
       '950', '1,000', '1,500', '1,300', '199', '80', '1,100', '160',
       '1,600', '230', '130', '50', '190', '1,700', '1,400', '180',
       '1,350', '2,200', '2,000', '1,800', '1,900', '2,500', '2,100',
       '3,000', '2,800', '3,400', '40', '1,250', '3,500', '4,000',
       '2,400', '2,600', '120', '1,450', '469', '70', '3,200', '60',
       '560', '240', '360', '6,000', '2,300', '4,100', '5,000', '3,700',
       '1,650', '2,700', '4,500', '140'], dtype=object)

In [5]:
df['approx_cost(for two people)']=df['approx_cost(for two people)'].str.replace(',','')
df['approx_cost(for two people)'].unique()
   ## Removing commas before changing the data type to numeric

array(['800', '300', '600', '700', '550', '500', '450', '650', '400',
       '900', '200', '750', '150', '850', '100', '1200', '350', '250',
       '950', '1000', '1500', '1300', '199', '80', '1100', '160', '1600',
       '230', '130', '50', '190', '1700', '1400', '180', '1350', '2200',
       '2000', '1800', '1900', '2500', '2100', '3000', '2800', '3400',
       '40', '1250', '3500', '4000', '2400', '2600', '120', '1450', '469',
       '70', '3200', '60', '560', '240', '360', '6000', '2300', '4100',
       '5000', '3700', '1650', '2700', '4500', '140'], dtype=object)

In [6]:
df['approx_cost(for two people)']=df['approx_cost(for two people)'].astype('float')   ## Data type changed
df['price_in_dollar']=df['approx_cost(for two people)'] / 88.7   ## Converting Indian Ruppes to  USD

In [7]:
df['rate'].unique()
   ## The rate column will be changed to numeric values

array(['4.1/5', '3.8/5', '3.7/5', '3.6/5', '4.6/5', '4.0/5', '4.2/5',
       '3.9/5', '3.1/5', '3.0/5', '3.2/5', '3.3/5', '2.8/5', '4.4/5',
       '4.3/5', 'NEW', '2.9/5', '3.5/5', nan, '2.6/5', '3.8 /5', '3.4/5',
       '4.5/5', '2.5/5', '2.7/5', '4.7/5', '2.4/5', '2.2/5', '2.3/5', '-',
       '3.6 /5', '4.8/5', '2.8 /5', '4.2 /5', '3.7 /5', '3.5 /5',
       '4.1 /5', '2.7 /5', '3.9 /5', '2.9 /5', '3.3 /5', '3.2 /5',
       '4.3 /5', '4.9/5', '2.1/5', '2.0/5', '4.4 /5', '4.5 /5', '1.8/5',
       '4.0 /5', '4.6 /5', '3.4 /5', '3.1 /5', '2.6 /5', '3.0 /5',
       '4.7 /5', '2.3 /5', '2.5 /5', '4.8 /5', '2.4 /5', '4.9 /5'],
      dtype=object)

In [8]:
df['rate']=df['rate'].astype('string')   ## Changing the data type from object to string in order to access the characters
df['rate']=df['rate'].str.replace('.','')   ## Removing the period '.' to access consecutive numbers

In [9]:
import re
def get_numbers(string):
    result=re.findall(r'\d+',string)
    return result
   ## A function for finding the two numbers representing the rate
for i in df['rate'].unique():
    try:
        r=get_numbers(i)
        df['rate']= df['rate'].str.replace(i,r[0])
    except:
        pass
   ## Replacing the text with only the numbers, errors will be handled next
df['rate'].unique()

<StringArray>
[ '41',  '38',  '37',  '36',  '46',  '40',  '42',  '39',  '31',  '30',  '32',
  '33',  '28',  '44',  '43', 'NEW',  '29',  '35',  <NA>,  '26',  '34',  '45',
  '25',  '27',  '47',  '24',  '22',  '23',   '-',  '48',  '49',  '21',  '20',
  '18']
Length: 34, dtype: string

In [10]:
missing_values=df['rate'].isin(['NEW','-']) | df['rate'].isna()
valid_data=df[~missing_values].copy()
   ## Selecting numeric data to replace missing values with the average
valid_data['rate']=valid_data['rate'].astype('float')
avg=valid_data['rate'].mean().astype(int)
print(avg)
## The average is 37, note the results may slightly change if the Kaggle dataset was updated

36

In [11]:
df['rate']=df['rate'].replace(['NEW','-',np.nan],str(avg))   ## Missing values replaced

In [12]:
df['rate']=df['rate'].astype('float')
df['rate']=df['rate'] / 10
df['rate'].unique()
   ## Dividing by 10, now the rate column shows the rate out of 5

array([4.1, 3.8, 3.7, 3.6, 4.6, 4. , 4.2, 3.9, 3.1, 3. , 3.2, 3.3, 2.8,
       4.4, 4.3, 2.9, 3.5, 2.6, 3.4, 4.5, 2.5, 2.7, 4.7, 2.4, 2.2, 2.3,
       4.8, 4.9, 2.1, 2. , 1.8])

In [13]:
df=df.dropna(subset=['cuisines'])
df=df.dropna(subset=['rest_type'])
   ## Removing restaurants with no registed type or cuisine

In [14]:
df['cuisines']=df['cuisines'].astype('string')   ## Changing the data type from object to string in order to access the characters
df['cuisines']=df['cuisines'].str.split(',')   ## Replacing commas with spaces
df1=df.explode('cuisines').reset_index(drop=True)
   ## Creating a separate dataframe containing each cuisine as a separate category to ensure an accurate count of each cuisine
   ## The original column hosted cells with multiple cuisines that would have been treated as one
df1['cuisines']=df1['cuisines'].str.strip()   ## Removing all spaces to avoid unique cuisines appearing twice
df1=df1['cuisines']   ## Only this column will be used in the report
df1.head()

0    North Indian
1         Mughlai
2         Chinese
3         Chinese
4    North Indian
Name: cuisines, dtype: object

In [15]:
df['rest_type']=df['rest_type'].astype('string')   ## Changing the data type from object to string in order to access the characters
df['rest_type']=df['rest_type'].str.split(',')   ## Replacing commas with spaces
df2=df.explode('rest_type').reset_index(drop=True)
   ## Creating a separate dataframe containing each type as a separate category to ensure an accurate count of each type
   ## The original column hosted cells with multiple types that would have been treated as one
df2['rest_type']=df2['rest_type'].str.strip()   ## Removing all spaces to avoid unique cuisines appearing twice
df2=df2[['rest_type','name']] ## Only these columns will be used in the report
df2['rest_type']=df2['rest_type'].dropna()
df2.head()

       rest_type                   name
0  Casual Dining                  Jalsa
1  Casual Dining         Spice Elephant
2           Cafe        San Churro Cafe
3  Casual Dining        San Churro Cafe
4    Quick Bites  Addhuri Udupi Bhojana

In [16]:
df.to_csv('restaurant-data.csv')
df1.to_csv('expanded_cuisines.csv')
df2.to_csv('expanded_type.csv')
   ## Dataframes saved